Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/tax_refund_when_unemployed_or_out_of_work_sick.html.txt.tmx
Source language: en
Languages: ga

source: Tax refund when unemployed or out of work sick
ga: Aisíocaíocht cánach má tá tú dífhostaithe nó as obair ar shaoire bhreoiteachta

source: You can get a refund of tax you have already paid if you were employed and find yourself unemployed
ga: Is féidir leat aisíoc a fháil ar cháin atá íoctha agat cheana féin má bhí tú fostaithe agus tú dífhostaithe anois

source: You may also get a tax refund if you are out of work due to illness
ga: Féadtar go mbeadh aisíoc cánach ag dul duit má tá tú as obair mar gheall ar thinneas

source: You can also get tax back if you are still employed but have paid more tax than you were liable for
ga: Is féidir leat cáin a fháil ar ais má tá tú fós fostaithe agus níos mó cánach íoctha agat ná mar a bhí tú faoi dhliteanas ina leith

source: Another way to get tax back is through tax relief on services or products that you have bought. Some of the cost of certain services and products can be recouped from the tax you have already paid to Revenue, for example, tax relief for employing a carer and tax relief for third level education fees
ga: Is féidir cáin a fháil ar ais freisin trí fhaoiseamh cánach i leith seirbhísí nó táirgí a cheannaigh tú Is féidir cuid de chostas seirbhísí agus táirgí áirithe a fháil ar ais ón gcáin atá íoctha agat cheana féin leis na Coimisinéirí Ioncaim, mar shampla, faoiseamh cánach i leith cúramóir a fhostú agus faoiseamh cánach ar tháillí oideachais tríú leibhéal

source: The amount of relief you get depends on the amount of tax you have paid
ga: Brathannn an méid faoisimh a fhaigheann tú ar mhéid na cánach atá íoctha agat

source: This document explains how to get a tax refund if you have worked and are now unemployed, getting Illness Benefit or short-term Occupational Injury Benefit, or if you are still employed but think you have paid more tax than you were liable to pay
ga: Míníonn an doiciméad seo conas aisíoc cánach a fháil má bhí tú ag obair agus tú dífhostaithe anois, má tá Sochar Breoiteachta nó Sochar Díobhála Ceirde gearrthéarmach á fháil agat, nó má tá tú dífhostaithe fós ach go gceapann tú gur íoc tú níos mó cánach ná mar a bhí tú faoi dhliteanas ina leith

source: Why would I get a tax refund?
ga: Cén fáth a mbeadh aisíoc cánach ar fáil dom?

source: There are a number of reasons why you may now be liable to pay less tax than previously thought and due a refund
ga: Tá cúiseanna éagsúla ann le go mbéifeá faoi dhliteanas anois níos lú cánach a íoc ná mar a cheap tú roimhe seo agus go mbeadh aisíoc dlite duit

source: Your tax liability may be reduced because you are on unpaid sick leave or have become unemployed
ga: Féadtar go ndéantar do dhliteanas cánach a laghdú mar go bhfuil tú ar saoire bhreoiteachta gan pá nó go bhfuil tú dífhostaithe anois

source: For PAYE workers your tax liability is spread out evenly over the year
ga: Maidir le hoibrithe ÍMAT roinntear do dhliteanas cánach go cothrom i rith na bliana

source: To ensure that this is achieved, your tax liability is normally calculated on a cumulative basis
ga: Le cinntiú go mbaintear seo amach, déantar do dhliteanas cánach a ríomh de ghnáth ar bhonn carnach

source: Any tax credits and standard rate cut-off point, which is not used in a pay period, is carried forward to the next pay period within that tax year
ga: Tugtar aon chreidmheasanna cánach agus pointe scoite an ráta chaighdeánaigh, nach n-úsáidtear i dtréimhse pá, ar aghaidh chuig an chéad thréimhse pá eile sa bhliain chánach sin

source: This means that when an employer calculates your tax liability, they actually calculate the total tax due from 1 January to the date which your most recent wages are paid
ga: Ciallaíonn sé seo nuair a dhéanann fostaitheoir do dhliteanas cánach a ríomh, déanann sé nó sí an cháin iomlán a ríomh atá dlite ó 1 Eanáir go dtí an dáta ar a n-íoctar do phá is déanaí

source: This means if your income is reduced, for example, by sickness or unemployment, you will have unused tax credits and may be due a tax refund
ga: Ciallaíonn sé seo má dhéantar d'ioncam a laghdú, mar shampla, trí thinneas nó trí dhífhostaíocht, go bhféadtar go mbeadh aisíoc cánach dlite duit

source: You may also get a refund if your tax liability has been incorrectly calculated by your employer and you have overpaid tax
ga: Gheobhfá aisíoc cánach freisin mura ndearna d'fhostaitheoir do dhliteanas cánach a ríomh i gceart agus má rinne tú cáin a ró-íocadh

source: A tax refund may also be paid if you have purchased goods or services for which you can claim tax relief
ga: Féadtar go n-íocfar aisíoc cánach má cheannaigh tú táirgí nó seirbhísí dá bhfuil tú in ann faoiseamh cánach a éileamh

source: If you are unemployed or out of work sick
ga: Má tá tú dífhostaithe nó ar saoire bhreoiteachta

source: If tax has been deducted from your pay since 1 January last and you are now unemployed, you may be entitled to a tax refund
ga: Má bhaineadh cáin as do phá ón 1 Eanáir deireanach agus má tá tú dífhostaithe anois féadtar go mbéifeá i dteideal aisíoc cánach a fháil

source: If you have not paid any tax, you will not be due a refund
ga: Murar íoc tú aon cháin, ní bheidh aisíoc dlite duit

source: Jobseeker’s Benefit (JB), Illness Benefit (IB) and payments under the Occupational Injury Benefit (OIB) Scheme (including Injury Benefit, Disablement Benefit and Incapacity Supplement) are all taxable sources of income
ga: Is foinsí ioncaim inchánach iad Sochar Cuardaitheora Poist (SCP), Sochar Breoiteachta (SB), agus Sochar Díobhála Ceirde (SDC)

source: However, the first €13 per week of Jobseeker’s Benefit is not taxable
ga: Níl an chéad €13 in aghaidh na seachtaine de Shochar Cuardaitheora Poist inchánaithe, áfach

source: Any Increase for a Qualified Child paid with Illness Benefit or a payment under the OIB scheme is not taxable
ga: Níl cion an SB nó an íocaíocht faoin scéim SDC don Mhéadú do Leanbh Incháilithe inchánaithe, áfach

source: If you are getting Jobseeker’s Benefit, Illness Benefit, or a payment under the Occupational Injury Benefit Scheme and make a claim for a tax refund, the taxable proportion of your JB, IB or OIB payment and your wages are added together to determine if you are entitled to a refund
ga: Má tá Sochar Cuardaitheora Poist, Sochar Breoiteachta, nó Sochar Díobhála Ceirde á fháil agat, agus má dhéanann tú éileamh ar aisíoc cánach, déantar cion inchánach do SCP, SB nó SDC a shuimiú le dearbhú an bhfuil tú i dteideal aisíoc cánach a fháil

source: If you are employed and think you may have overpaid tax
ga: Má tá tú dífhostaithe agus má cheapann tú go ndearna tú cáin a ró-íoc

source: If you think your employer has incorrectly calculated your tax liability you must submit your P60 and written details of your claim
ga: Má cheapann tú nach ndearna d'fhostaitheoir do dhliteanas cánach a ríomh i gceart caithfidh tú do P60 agus sonraí i scríbhinn faoi d'éileamh a chur isteach

source: If your spouse or civil partner is working you must also submit their P60
ga: Má tá do chéile ag obair caithfidh tú a P60 a chur isteach freisin

source: A P60 is given to you by your employer at the end of each year
ga: Tugann d'fhostaitheoir P60 duit ag deireadh gach bliana

source: Unemployed or out of work sick
ga: Dífhostaithe nó as obair ar shaoire bhreoiteachta

source: The amount of tax refund depends on:
ga: Brathfaidh méid an aisíoca cánach ar:

source: • The length of time you have been unemployed
ga: • Fad do thréimhse dífhostaíochta

source: • The amount of tax you have paid
ga: • Méid na cánach atá íoctha agat

source: • The amount of tax credits you have used
ga: • Méid na gcreidmheasanna cánach a d'úsáid tú

source: • The amount of your weekly social welfare payment
ga: • Méid do íocaíocht leasa shóisialaigh sheachtainiúil

source: How your tax refund is paid
ga: Mar a íoctar d'aisíoc cánach

source: Revenue will issue a cheque if you are unemployed and due a tax refund
ga: Má tá tú dífhostaithe agus má tá aisíoc cánach dlite duit déanfaidh na Coimisinéirí Ioncaim seic a eisiúint duit

source: If you are out of work sick, when you return to work your employer usually refunds your tax in your first week's wages
ga: Má tá tú as obair ar shaoire bhreoiteachta, nuair a thagann tú ar ais chun oibre aisíocann d'fhostaitheoir do cháin i do chéad phá seachtaine de ghnáth

source: You should apply 4 weeks from the date you become unemployed, however, if emergency tax was being deducted by your former employer you should apply immediately
ga: Ba chóir duit iarratas a dhéanamh 4 sheachtain ón dáta ar a dtáinig tú chun bheith dífhostaithe, ach má bhí cáin éigeandála á baint ag d'iarfhostaitheoir ba chóir duit iarratas a dhéanamh gan mhoill

source: You should apply 8 weeks from the date you became unemployed, if you are getting another income which is taxable. This includes taxable social welfare payments
ga: Ba chóir duit iarratas a dhéanamh 8 seachtain ón dáta ar a dtáinig tú chun bheith dífhostaithe, má tá ioncam eile á fháil agat atá inchánach, agus íocaíochtaí leasa shóisialaigh inchánach san áireamh seo

source: Your application for a tax repayment because you are unemployed or out of work sick, must be made on tax repayment Form P50 and sent to your tax office with Parts 2 and 3 of your P45
ga: Iarratas ar aisíoc cánach mar go bhfuil tú dífhostaithe nó as obair ar shaoire bhreoiteachta, caithfear é a dhéanamh ar Fhoirm aisíoca cánach P50 agus é a sheoladh chuig d'oifig cánach áitiúil in éineacht le Codanna 2 agus 3 de do P45

source: When you return to work from unpaid sick leave, you should notify your tax office of the amount of Illness Benefit paid during your illness
ga: Nuair a fhilleann tú ar an obair ó shaoire bhreoiteachta gan íocaíocht, ba chóir duit fógra a thabhairt d’oifig cánach ar mhéid an tSochair Breoiteachta a íocadh le linn do bhreoiteachta

source: Revenue will then issue you with your correct Tax Credit Certificate
ga: Eiseoidh na Coimisinéirí an Deimhniú Creidmheasa Cánach ceart chugat

source: Your employer will also get a copy (showing totals only) and refund any tax you are due, when you return to work
ga: Gheobhaidh d’fhostóir cóip freisin (na hiomláin amháin léirithe) agus aisíocfar cáin ar bith a bheidh dlite duit nuair a fhilleann tú ar an obair

source: For further information on getting a tax refund, contact Revenue
ga: Le tuilleadh eolais maidir le aisíoc a fháil, déan teagmháil leis na Coimisinéirí Ioncaim

source: Use the Revenue contact locator to find the Lo-call number for your region
ga: Bain úsáid as aimsitheoir teagmhála na gCoimisinéirí Ioncaim le huimhir Lóghlao do réigiúin féin a fháil

source: You can find Revenue contact details for your region here
ga: Is féidir leat sonraí teagmhála na gCoimisinéirí Ioncaim do do réigiún féin a fháil anseo
